feat: write tests and pipelines
